### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.eventhubs.module.etl.azurerm_eventhub.events["io-p-itn-com-etl-cqrs-message-evh-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-com-etl-cqrs-message-evh-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "io-p-itn-com-etl-evhns-01"
      + partition_count     = 5
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + status              = "Active"
    }

  # module.eventhubs.module.etl.azurerm_eventhub.events["io-p-itn-com-etl-cqrs-message-status-evh-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-com-etl-cqrs-message-status-evh-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "io-p-itn-com-etl-evhns-01"
      + partition_count     = 5
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + status              = "Active"
    }

  # module.eventhubs.module.etl.azurerm_eventhub.events["io-p-itn-com-etl-payment-updates-evh-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-com-etl-payment-updates-evh-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "io-p-itn-com-etl-evhns-01"
      + partition_count     = 5
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + status              = "Active"
    }

  # module.eventhubs.module.etl.azurerm_eventhub.events["io-p-itn-com-etl-reminder-message-send-evh-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-com-etl-reminder-message-send-evh-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "io-p-itn-com-etl-evhns-01"
      + partition_count     = 5
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + status              = "Active"
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-cqrs-message-evh-01.cqrs"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-cqrs-message-evh-01"
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "cqrs"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-cqrs-message-evh-01.paymentup"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-cqrs-message-evh-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "paymentup"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-cqrs-message-evh-01.reminder"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-cqrs-message-evh-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "reminder"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-cqrs-message-status-evh-01.cqrs"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-cqrs-message-status-evh-01"
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "cqrs"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-cqrs-message-status-evh-01.reminder"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-cqrs-message-status-evh-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "reminder"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-payment-updates-evh-01.cqrs"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-payment-updates-evh-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "cqrs"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-payment-updates-evh-01.payment-updater"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-payment-updates-evh-01"
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "payment-updater"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-payment-updates-evh-01.reminder"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-payment-updates-evh-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "reminder"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-reminder-message-send-evh-01.reminder"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-reminder-message-send-evh-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "reminder"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```

</details>
